# Series Exercise and Assignment

In [1]:
import numpy as np
import pandas as pd

In [2]:
age = [23, 35, 13, 36, 75, 99]
type(age)

list

In [3]:
age_series = pd.Series(age, name="AGE")
print(age_series)

0    23
1    35
2    13
3    36
4    75
5    99
Name: AGE, dtype: int64

In [4]:
print(age_series.index)
print(age_series.values)
print(age_series.name)
print(age_series.dtype)

RangeIndex(start=0, stop=6, step=1)
[23 35 13 36 75 99]
AGE
int64

In [5]:
age_series.astype('bool')

0    True
1    True
2    True
3    True
4    True
5    True
Name: AGE, dtype: bool

In [6]:
age_series[2]
age_series[:2]
age_series[-1:]
age_series[-3:-1]

3    36
4    75
Name: AGE, dtype: int64

In [7]:
names=['Sakib', 'Tanbir', 'Afiya', 'Sajid', 'Meher', 'Mahi']
age_series = pd.Series(age, index = names, name='Age_Series') ##here the values and index should be equal in size
age_series

Sakib     23
Tanbir    35
Afiya     13
Sajid     36
Meher     75
Mahi      99
Name: Age_Series, dtype: int64

In [8]:
age_series['Meher']
age_series['Afiya' : 'Meher'] ##here the ending point is not excluded

Afiya    13
Sajid    36
Meher    75
Name: Age_Series, dtype: int64

In [9]:
age_series.iloc[2:3]

Afiya    13
Name: Age_Series, dtype: int64

In [10]:
age_series.loc['Sakib']

23

In [11]:
age_series.loc['Sakib': 'Meher']

Sakib     23
Tanbir    35
Afiya     13
Sajid     36
Meher     75
Name: Age_Series, dtype: int64

In [12]:
goals = [3,5, 67, 8, 2, 7]
footballers = ['Kaka', 'Ronaldo', 'Nyemar', 'Kaka', 'Benzema', 'Vini']

In [13]:
goals_series = pd.Series(goals, index = footballers, name = 'goal_stat')
goals_series

Kaka        3
Ronaldo     5
Nyemar     67
Kaka        8
Benzema     2
Vini        7
Name: goal_stat, dtype: int64

In [14]:
goals_series.loc['Kaka']

Kaka    3
Kaka    8
Name: goal_stat, dtype: int64

In [15]:
goals_series.reset_index()

     index  goal_stat
0     Kaka          3
1  Ronaldo          5
2   Nyemar         67
3     Kaka          8
4  Benzema          2
5     Vini          7

In [16]:
goals_series

Kaka        3
Ronaldo     5
Nyemar     67
Kaka        8
Benzema     2
Vini        7
Name: goal_stat, dtype: int64

In [17]:
goals_series.reset_index(drop = True)

0     3
1     5
2    67
3     8
4     2
5     7
Name: goal_stat, dtype: int64

In [18]:
# Task - 1
# find out the first and last 5 days average oil consumption
# find out only January, 2017 average oil consumptio

In [19]:
oil_data = pd.read_csv('data/retail/oil.csv', index_col = 'date', parse_dates=True)

In [20]:
oil_data.head() ##head() shows first five datas from series or dataframe

            dcoilwtico
date
2013-01-01         NaN
2013-01-02       93.14
2013-01-03       92.97
2013-01-04       93.12
2013-01-07       93.20

In [21]:
print(oil_data.iloc[:5].mean())
print(oil_data.iloc[-5:].mean())

dcoilwtico    93.1075
dtype: float64
dcoilwtico    46.746
dtype: float64

In [22]:
oil_data.loc['2017-05':'2017-06'].mean()

dcoilwtico    46.827045
dtype: float64

In [23]:
goals_series

Kaka        3
Ronaldo     5
Nyemar     67
Kaka        8
Benzema     2
Vini        7
Name: goal_stat, dtype: int64

In [24]:
goals_series.loc[goals_series>7]

Nyemar    67
Kaka       8
Name: goal_stat, dtype: int64

In [25]:
mask = (goals_series>3) & (goals_series.index == 'Kaka')
goals_series.loc[mask]

Kaka    8
Name: goal_stat, dtype: int64

In [26]:
goals_series.eq(2)

Kaka       False
Ronaldo    False
Nyemar     False
Kaka       False
Benzema     True
Vini       False
Name: goal_stat, dtype: bool

In [27]:
goals_series.index.isin(['Neymar', 'Messi'])

array([False, False, False, False, False, False])

In [28]:
goals_series.sort_values()

Benzema     2
Kaka        3
Ronaldo     5
Vini        7
Kaka        8
Nyemar     67
Name: goal_stat, dtype: int64

In [29]:
goals_series.sort_index()

Benzema     2
Kaka        3
Kaka        8
Nyemar     67
Ronaldo     5
Vini        7
Name: goal_stat, dtype: int64

In [30]:
##Task

##First, can you get me the 10 lowest prices from the data, sorted by date, starting with the most recent and ending with the oldest?
##After that, return to the original data. I’ve provided a list of dates I want to narrow down to, and I also want to look only at prices less than or equal to 50 dollars per barrel.

In [31]:
oil_data

            dcoilwtico
date
2013-01-01         NaN
2013-01-02       93.14
2013-01-03       92.97
2013-01-04       93.12
2013-01-07       93.20
...                ...
2017-08-25       47.65
2017-08-28       46.40
2017-08-29       46.46
2017-08-30       45.96
2017-08-31       47.26

[1218 rows x 1 columns]

In [32]:
oil_data.sort_values(by='dcoilwtico')[:10].mean()

dcoilwtico    28.375
dtype: float64

In [33]:
price = oil_data['dcoilwtico']
price

date
2013-01-01      NaN
2013-01-02    93.14
2013-01-03    92.97
2013-01-04    93.12
2013-01-07    93.20
              ...
2017-08-25    47.65
2017-08-28    46.40
2017-08-29    46.46
2017-08-30    45.96
2017-08-31    47.26
Name: dcoilwtico, Length: 1218, dtype: float64

In [34]:
print(price.iloc[:10].sort_index(ascending=False))
print(price.iloc[-10:].mean())

date
2013-01-14    94.27
2013-01-11    93.60
2013-01-10    93.81
2013-01-09    93.08
2013-01-08    93.21
2013-01-07    93.20
2013-01-04    93.12
2013-01-03    92.97
2013-01-02    93.14
2013-01-01      NaN
Name: dcoilwtico, dtype: float64
47.30499999999999

In [35]:
given_dates =['2016-01-04', '2016-05-12', '2017-03-07']

In [36]:
mask = price.loc[given_dates] >=50

In [37]:
goals_series

Kaka        3
Ronaldo     5
Nyemar     67
Kaka        8
Benzema     2
Vini        7
Name: goal_stat, dtype: int64

In [38]:
goals_series + 2

Kaka        5
Ronaldo     7
Nyemar     69
Kaka       10
Benzema     4
Vini        9
Name: goal_stat, dtype: int64

In [39]:
goals_series.add(3)

Kaka        6
Ronaldo     8
Nyemar     70
Kaka       11
Benzema     5
Vini       10
Name: goal_stat, dtype: int64

In [40]:
goals_series_update = "@" + goals_series.astype('float64').astype('str')  ## we cant  convert int into string directly. firstly we have to convert it into float , then sting for concating to another string
type(goals_series_update)

pandas.core.series.Series

In [41]:
goals_series_update.str.contains('7')

Kaka       False
Ronaldo    False
Nyemar      True
Kaka       False
Benzema    False
Vini        True
Name: goal_stat, dtype: bool

In [42]:
goals_series_update.str.replace('@', '').astype('float64').astype('int')

Kaka        3
Ronaldo     5
Nyemar     67
Kaka        8
Benzema     2
Vini        7
Name: goal_stat, dtype: int32

In [43]:
goals_series

Kaka        3
Ronaldo     5
Nyemar     67
Kaka        8
Benzema     2
Vini        7
Name: goal_stat, dtype: int64

In [44]:
goals_series.sum()

92

In [45]:
goals_series.loc['Kaka'].sum() #return the sum of all kaka goals

11

In [46]:
goals_series.value_counts()

3     1
5     1
67    1
8     1
2     1
7     1
Name: goal_stat, dtype: int64

In [47]:
goals_series_update

Kaka        @3.0
Ronaldo     @5.0
Nyemar     @67.0
Kaka        @8.0
Benzema     @2.0
Vini        @7.0
Name: goal_stat, dtype: object

In [48]:
goals_series_update = goals_series_update.str.replace('@', '').astype('float64').astype('int')
goals_series_update

Kaka        3
Ronaldo     5
Nyemar     67
Kaka        8
Benzema     2
Vini        7
Name: goal_stat, dtype: int32

In [49]:
goals_series_update = goals_series_update.reset_index()
goals_series_update

     index  goal_stat
0     Kaka          3
1  Ronaldo          5
2   Nyemar         67
3     Kaka          8
4  Benzema          2
5     Vini          7

In [50]:
goals_series_update['index'].value_counts()

Kaka       2
Ronaldo    1
Nyemar     1
Benzema    1
Vini       1
Name: index, dtype: int64

In [51]:
goals_series_update['index'].unique()

array(['Kaka', 'Ronaldo', 'Nyemar', 'Benzema', 'Vini'], dtype=object)

In [52]:
goals_series_update['index'].nunique()

5

In [53]:
sales = [3,4 , 53, np.nan, 3423, 64]
sales_series = pd.Series(sales, name = 'sales_series')
sales_series

0       3.0
1       4.0
2      53.0
3       NaN
4    3423.0
5      64.0
Name: sales_series, dtype: float64

In [54]:
sales_series + 1

0       4.0
1       5.0
2      54.0
3       NaN
4    3424.0
5      65.0
Name: sales_series, dtype: float64

In [55]:
sales_series.add(2, fill_value = 3)

0       5.0
1       6.0
2      55.0
3       5.0
4    3425.0
5      66.0
Name: sales_series, dtype: float64

In [56]:
age = [2, 35, 24, np.nan, 34, np.nan]
age_series = pd.Series(age, name='age_series')
age_series

0     2.0
1    35.0
2    24.0
3     NaN
4    34.0
5     NaN
Name: age_series, dtype: float64

In [57]:
age_series.dropna()

0     2.0
1    35.0
2    24.0
4    34.0
Name: age_series, dtype: float64

In [58]:
age_series.value_counts(dropna = False)

NaN     2
2.0     1
35.0    1
24.0    1
34.0    1
Name: age_series, dtype: int64

In [59]:
age_series=age_series.fillna('3').astype('float64')

In [60]:
age_series

0     2.0
1    35.0
2    24.0
3     3.0
4    34.0
5     3.0
Name: age_series, dtype: float64

In [61]:
age_series.apply(lambda x : round(x*0.9, 2) if x>24 else x)

0     2.0
1    31.5
2    24.0
3     3.0
4    30.6
5     3.0
Name: age_series, dtype: float64

In [62]:
age_series.where(age_series<=24, round(age_series*0.9, 2))

0     2.0
1    31.5
2    24.0
3     3.0
4    30.6
5     3.0
Name: age_series, dtype: float64

# Pandas Exercise and Assignment

In [63]:
retail_data = pd.read_csv('data/retail/retail_2016_2017.csv')
retail_data

,id,date,store_nbr,family,sales,onpromotion
0,1945944,2016-01-01,1,AUTOMOTIVE,0.000,0
1,1945945,2016-01-01,1,BABY CARE,0.000,0
2,1945946,2016-01-01,1,BEAUTY,0.000,0
3,1945947,2016-01-01,1,BEVERAGES,0.000,0
4,1945948,2016-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [64]:
print(retail_data.shape)
print(retail_data.dtypes)
print(retail_data.index)
print(retail_data.columns)
print(retail_data.axes)

(1054944, 6)
id               int64
date            object
store_nbr        int64
family          object
sales          float64
onpromotion      int64
dtype: object
RangeIndex(start=0, stop=1054944, step=1)
Index(['id', 'date', 'store_nbr', 'family', 'sales', 'onpromotion'], dtype='object')
[RangeIndex(start=0, stop=1054944, step=1), Index(['id', 'date', 'store_nbr', 'family', 'sales', 'onpromotion'], dtype='object')]

Task<br><br>
- I need some help analyzing our transactions to make sure there aren’t any irregularities in the numbers. The data is stored in data/retail/transactions.csv
- Can you read this data in and remind me how many rows are in the data, which columns are in the data, and their datatypes? Mor

In [65]:
transactions = pd.read_csv('data/retail/transactions.csv')
transactions

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [66]:
print('number of rows are: \n', transactions.index)
print('the data type of the transactions data set is: \n', transactions.dtypes)

number of rows are:
 RangeIndex(start=0, stop=83488, step=1)
the data type of the transactions data set is:
 date            object
store_nbr        int64
transactions     int64
dtype: object

In [67]:
retail_data

,id,date,store_nbr,family,sales,onpromotion
0,1945944,2016-01-01,1,AUTOMOTIVE,0.000,0
1,1945945,2016-01-01,1,BABY CARE,0.000,0
2,1945946,2016-01-01,1,BEAUTY,0.000,0
3,1945947,2016-01-01,1,BEVERAGES,0.000,0
4,1945948,2016-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [68]:
retail_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1054944 entries, 0 to 1054943
Data columns (total 6 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   id           1054944 non-null  int64
 1   date         1054944 non-null  object
 2   store_nbr    1054944 non-null  int64
 3   family       1054944 non-null  object
 4   sales        1054944 non-null  float64
 5   onpromotion  1054944 non-null  int64
dtypes: float64(1), int64(3), object(2)
memory usage: 48.3+ MB

In [69]:
retail_data.describe(include='all').round()

               id        date  store_nbr      family      sales  onpromotion
count   1054944.0     1054944  1054944.0     1054944  1054944.0    1054944.0
unique        NaN         592        NaN          33        NaN          NaN
top           NaN  2016-01-01        NaN  AUTOMOTIVE        NaN          NaN
freq          NaN        1782        NaN       31968        NaN          NaN
mean    2473416.0         NaN       28.0         NaN      458.0          6.0
std      304536.0         NaN       16.0         NaN     1317.0         18.0
min     1945944.0         NaN        1.0         NaN        0.0          0.0
25%     2209680.0         NaN       14.0         NaN        2.0          0.0
50%     2473416.0         NaN       28.0         NaN       24.0          0.0
75%     2737151.0         NaN       41.0         NaN      262.0          3.0
max     3000887.0         NaN       54.0         NaN   124717.0        741.0

In [70]:
transactions

             date  store_nbr  transactions
0      2013-01-01         25           770
1      2013-01-02          1          2111
2      2013-01-02          2          2358
3      2013-01-02          3          3487
4      2013-01-02          4          1922
...           ...        ...           ...
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

[83488 rows x 3 columns]

In [71]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [72]:
transactions.describe(include='all').round()

              date  store_nbr  transactions
count        83488    83488.0       83488.0
unique        1682        NaN           NaN
top     2017-08-15        NaN           NaN
freq            54        NaN           NaN
mean           NaN       27.0        1695.0
std            NaN       16.0         963.0
min            NaN        1.0           5.0
25%            NaN       13.0        1046.0
50%            NaN       27.0        1393.0
75%            NaN       40.0        2079.0
max            NaN       54.0        8359.0

In [73]:
transactions.columns=['date', 'store number', 'trans']
transactions.head()

         date  store number  trans
0  2013-01-01            25    770
1  2013-01-02             1   2111
2  2013-01-02             2   2358
3  2013-01-02             3   3487
4  2013-01-02             4   1922

In [74]:
transactions['store number'].head()

0    25
1     1
2     2
3     3
4     4
Name: store number, dtype: int64

In [75]:
retail_data

,id,date,store_nbr,family,sales,onpromotion
0,1945944,2016-01-01,1,AUTOMOTIVE,0.000,0
1,1945945,2016-01-01,1,BABY CARE,0.000,0
2,1945946,2016-01-01,1,BEAUTY,0.000,0
3,1945947,2016-01-01,1,BEVERAGES,0.000,0
4,1945948,2016-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [76]:
retail_data.store_nbr

0          1
1          1
2          1
3          1
4          1
          ..
1054939    9
1054940    9
1054941    9
1054942    9
1054943    9
Name: store_nbr, Length: 1054944, dtype: int64

In [77]:
retail_data.date.nunique()

592

In [78]:
retail_data['sales'].mean().round(2)

457.72

In [79]:
retail_data['family'].value_counts()[-4:]

BOOKS        31968
BEVERAGES    31968
BEAUTY       31968
SEAFOOD      31968
Name: family, dtype: int64

In [80]:
retail_data[['family', 'sales', 'onpromotion']]

                             family     sales  onpromotion
0                        AUTOMOTIVE     0.000            0
1                         BABY CARE     0.000            0
2                            BEAUTY     0.000            0
3                         BEVERAGES     0.000            0
4                             BOOKS     0.000            0
...                             ...       ...          ...
1054939                     POULTRY   438.133            0
1054940              PREPARED FOODS   154.553            1
1054941                     PRODUCE  2419.729          148
1054942  SCHOOL AND OFFICE SUPPLIES   121.000            8
1054943                     SEAFOOD    16.000            0

[1054944 rows x 3 columns]

In [81]:
retail_data

,id,date,store_nbr,family,sales,onpromotion
0,1945944,2016-01-01,1,AUTOMOTIVE,0.000,0
1,1945945,2016-01-01,1,BABY CARE,0.000,0
2,1945946,2016-01-01,1,BEAUTY,0.000,0
3,1945947,2016-01-01,1,BEVERAGES,0.000,0
4,1945948,2016-01-01,1,BOOKS,0.000,0
...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [82]:
retail_data.iloc[2:13, :3]

         id        date  store_nbr
2   1945946  2016-01-01          1
3   1945947  2016-01-01          1
4   1945948  2016-01-01          1
5   1945949  2016-01-01          1
6   1945950  2016-01-01          1
7   1945951  2016-01-01          1
8   1945952  2016-01-01          1
9   1945953  2016-01-01          1
10  1945954  2016-01-01          1
11  1945955  2016-01-01          1
12  1945956  2016-01-01          1

In [83]:
transactions

             date  store number  trans
0      2013-01-01            25    770
1      2013-01-02             1   2111
2      2013-01-02             2   2358
3      2013-01-02             3   3487
4      2013-01-02             4   1922
...           ...           ...    ...
83483  2017-08-15            50   2804
83484  2017-08-15            51   1573
83485  2017-08-15            52   2255
83486  2017-08-15            53    932
83487  2017-08-15            54    802

[83488 rows x 3 columns]

In [84]:
transactions[1:].loc[:, ['store number', 'trans']]

       store number  trans
1                 1   2111
2                 2   2358
3                 3   3487
4                 4   1922
5                 5   1903
...             ...    ...
83483            50   2804
83484            51   1573
83485            52   2255
83486            53    932
83487            54    802

[83487 rows x 2 columns]

In [85]:
transactions[1:].loc[:, ['store number']].nunique()

store number    54
dtype: int64

In [86]:
transactions[1:].loc[:, ['store number']].sum()

store number    2249078
dtype: int64

In [87]:
transactions.drop(0, axis=0).head()

         date  store number  trans
1  2013-01-02             1   2111
2  2013-01-02             2   2358
3  2013-01-02             3   3487
4  2013-01-02             4   1922
5  2013-01-02             5   1903

In [88]:
transactions.drop(range(5), axis=0)

             date  store number  trans
5      2013-01-02             5   1903
6      2013-01-02             6   2143
7      2013-01-02             7   1874
8      2013-01-02             8   3250
9      2013-01-02             9   2940
...           ...           ...    ...
83483  2017-08-15            50   2804
83484  2017-08-15            51   1573
83485  2017-08-15            52   2255
83486  2017-08-15            53    932
83487  2017-08-15            54    802

[83483 rows x 3 columns]

Task <br>
- Can you drop the first row of data this time? A slice is fine for viewing but we want this permanently removed. 
- Also, drop the date column, but not in place.
- Then, can you get me a DataFrame that includes only the last row for each of our stores? I want to take a look at the most recent data for each.

In [108]:
##retail_data.drop(range(1), axis=0, inplace=True).head()
transactions.drop(range(10,40), axis=0)
transactions

KeyError: '[10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39] not found in axis'

In [90]:
transactions.drop_duplicates(keep='last', ignore_index=True)

             date  store number  trans
0      2013-01-01            25    770
1      2013-01-02             1   2111
2      2013-01-02             3   3487
3      2013-01-02             4   1922
4      2013-01-02             5   1903
...           ...           ...    ...
83482  2017-08-15            50   2804
83483  2017-08-15            51   1573
83484  2017-08-15            52   2255
83485  2017-08-15            53    932
83486  2017-08-15            54    802

[83487 rows x 3 columns]

In [91]:
transactions.isna().sum()

date            0
store number    0
trans           0
dtype: int64

Task # oil data - 'data/retail/oil.csv'
- Can you tell if any dates or prices are missing?
- I’d like to see the mean oil price if we fill in the missing values with 0 
- compare it to the mean oil price if we fill them in with the mean.

In [92]:
oil_df = pd.read_csv('data/retail/oil.csv')
oil_df

            date  dcoilwtico
0     2013-01-01         NaN
1     2013-01-02       93.14
2     2013-01-03       92.97
3     2013-01-04       93.12
4     2013-01-07       93.20
...          ...         ...
1213  2017-08-25       47.65
1214  2017-08-28       46.40
1215  2017-08-29       46.46
1216  2017-08-30       45.96
1217  2017-08-31       47.26

[1218 rows x 2 columns]

In [93]:
print(f'There are null values \n{oil_df.isna().sum()} ')

There are null values
date           0
dcoilwtico    43
dtype: int64

In [94]:
mean_oil_price= oil_df['dcoilwtico'].fillna(0).mean().round(2)
mean_oil_price

65.32

In [95]:
#compare it to the mean oil price if we fill them in with the mean.
oil_df['dcoilwtico'].fillna(oil_df['dcoilwtico'].mean()).sum().round(2) - oil_df['dcoilwtico'].fillna(0).mean().round(2)

82410.78

In [96]:
retail_data.loc[retail_data['date'] == '2017-08-15']

,id,date,store_nbr,family,sales,onpromotion
1053162,2999106,2017-08-15,1,AUTOMOTIVE,4.000,0
1053163,2999107,2017-08-15,1,BABY CARE,0.000,0
1053164,2999108,2017-08-15,1,BEAUTY,4.000,1
1053165,2999109,2017-08-15,1,BEVERAGES,1942.000,11
1053166,2999110,2017-08-15,1,BOOKS,0.000,0
...,...,...,...,...,...,...
1054939,3000883,2017-08-15,9,POULTRY,438.133,0
1054940,3000884,2017-08-15,9,PREPARED FOODS,154.553,1
1054941,3000885,2017-08-15,9,PRODUCE,2419.729,148
1054942,3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
1054943,3000887,2017-08-15,9,SEAFOOD,16.000,0

In [97]:
retail_data.loc[retail_data['date'] == '2017-08-15', ['sales', 'family']]

            sales                      family
1053162     4.000                  AUTOMOTIVE
1053163     0.000                   BABY CARE
1053164     4.000                      BEAUTY
1053165  1942.000                   BEVERAGES
1053166     0.000                       BOOKS
...           ...                         ...
1054939   438.133                     POULTRY
1054940   154.553              PREPARED FOODS
1054941  2419.729                     PRODUCE
1054942   121.000  SCHOOL AND OFFICE SUPPLIES
1054943    16.000                     SEAFOOD

[1782 rows x 2 columns]

In [98]:
mask = retail_data['family'].isin(["BEVERAGES", 'SEAFOOD']) & (retail_data['sales']>50)

In [99]:
retail_data.loc[mask]
retail_data.loc[mask]

              id        date  store_nbr     family   sales  onpromotion
564      1946508  2016-01-01         25  BEVERAGES  5104.0            1
1785     1947729  2016-01-02          1  BEVERAGES  1856.0            7
1818     1947762  2016-01-02         10  BEVERAGES  2052.0            1
1851     1947795  2016-01-02         11  BEVERAGES  8238.0            2
1884     1947828  2016-01-02         12  BEVERAGES  2290.0            1
...          ...         ...        ...        ...     ...          ...
1054782  3000726  2017-08-15         54  BEVERAGES  4332.0           23
1054815  3000759  2017-08-15          6  BEVERAGES  2678.0           10
1054848  3000792  2017-08-15          7  BEVERAGES  3999.0            9
1054881  3000825  2017-08-15          8  BEVERAGES  3626.0            8
1054914  3000858  2017-08-15          9  BEVERAGES  3530.0           26

[35910 rows x 6 columns]

In [100]:
#retail_data.query('family in ['SEAFOOD'] and sales>1000)

Task - *Dataset: Transactions 'data/retail/transactions.csv'*<br>
- First, calculate the percentage of times ALL stores had more than 2000 transactions
- Then, calculate the percentage of times store 25 had more than 2000 transactions, and calculate the sum of transactions on these days
- Finally, sum the transactions for stores 25 and 3, that occurred in May or June, and had less than 2000 transactions

In [101]:
transactions.loc[transactions['trans']>2000].index[25] + transactions.loc[transactions['trans']>2000].index[3]

94

Task - *Dataset: Transactions 'data/retail/transactions.csv'*<br>
- Can you get me a dataset that includes the 5 days with the highest transactions counts? Any similarities between them?
- Then, can you get me a dataset sorted by date from earliest to most recent, but with the highest transactions first and the lowest transactions last for each day?
- Finally, sort the columns in reverse alphabetical order.

In [102]:
transactions.sort_values('trans', ascending= False).head(5)

             date  store number  trans
52011  2015-12-23            44   8359
71010  2016-12-23            44   8307
16570  2013-12-23            44   8256
33700  2014-12-23            44   8120
16572  2013-12-23            46   8001

In [103]:
transactions.sort_values('date', ascending= False).head(10).sort_values('trans', ascending=False)

             date  store number  trans
83457  2017-08-15            24   2138
83453  2017-08-15            20   1516
83451  2017-08-15            18   1343
83452  2017-08-15            19   1158
83454  2017-08-15            21   1059
83456  2017-08-15            23    946
83458  2017-08-15            25    849
83446  2017-08-15            13    842
83487  2017-08-15            54    802
83455  2017-08-15            22    766

In [109]:
transactions.duplicated()

0        False
1        False
3        False
4        False
9        False
         ...
83483    False
83484    False
83485    False
83486    False
83487    False
Length: 83453, dtype: bool

In [111]:
transactions.columns = ['date', 'store_number', 'transactions']
transactions

             date  store_number  transactions
0      2013-01-01            25           770
1      2013-01-02             1          2111
3      2013-01-02             3          3487
4      2013-01-02             4          1922
9      2013-01-02             9          2940
...           ...           ...           ...
83483  2017-08-15            50          2804
83484  2017-08-15            51          1573
83485  2017-08-15            52          2255
83486  2017-08-15            53           932
83487  2017-08-15            54           802

[83453 rows x 3 columns]

In [114]:
transactions.rename(columns = {'store_number': 'store_nbr', 'transactions': 'trans'})

             date  store_nbr  trans
0      2013-01-01         25    770
1      2013-01-02          1   2111
3      2013-01-02          3   3487
4      2013-01-02          4   1922
9      2013-01-02          9   2940
...           ...        ...    ...
83483  2017-08-15         50   2804
83484  2017-08-15         51   1573
83485  2017-08-15         52   2255
83486  2017-08-15         53    932
83487  2017-08-15         54    802

[83453 rows x 3 columns]

In [116]:
transactions.rename(columns = lambda x: x.upper())

             DATE  STORE_NUMBER  TRANSACTIONS
0      2013-01-01            25           770
1      2013-01-02             1          2111
3      2013-01-02             3          3487
4      2013-01-02             4          1922
9      2013-01-02             9          2940
...           ...           ...           ...
83483  2017-08-15            50          2804
83484  2017-08-15            51          1573
83485  2017-08-15            52          2255
83486  2017-08-15            53           932
83487  2017-08-15            54           802

[83453 rows x 3 columns]

Task - *Dataset: Transactions 'data/retail/transactions.csv'*<br>
- Can you send me the transaction data with the columns renamed? 
    - transactions -> transaction_count, store_nbr -> store_number
- I want them looking a bit prettier for my presentation – you can find more details in the notebook.
Also, could you reorder the columns so date is first, then transaction count, then store number?

In [120]:
transactions.columns = ['date', 'store_number', 'transaction_count']
transactions.head()

         date  store_number  transaction_count
0  2013-01-01            25                770
1  2013-01-02             1               2111
3  2013-01-02             3               3487
4  2013-01-02             4               1922
9  2013-01-02             9               2940

In [126]:
transactions.reindex(labels = ['date', 'transaction_count', 'store_number'] , axis =1).head()

         date  transaction_count  store_number
0  2013-01-01                770            25
1  2013-01-02               2111             1
3  2013-01-02               3487             3
4  2013-01-02               1922             4
9  2013-01-02               2940             9